#+TITLE:Effective Modern C++ Notes
*****   Consider the code shown below:
      #+begin_src C++ :results output
        #include<iostream>
        #include<memory>

        struct MyClass {
            int iVal;
            bool bVal;
            MyClass(int v, bool b) {
                std::cout << "Cstr with int and bool\n";
            }
            MyClass(std::initializer_list<int> il) {
                std::cout << "Cstr with initializer_list\n";
            }
        };

        int main() {
            MyClass obj1(10, true);
            MyClass obj2{10, true};
            auto spv = std::make_shared<MyClass>(10, true);
            // Next two lines show how to use the initializer list workaround
            auto initList = {10, 20};
            auto spv1 = std::make_shared<MyClass>(initList);
            return 0;
        }
      #+end_src
      #+RESULTS:
      : Cstr with int and bool
      : Cstr with initializer_list
      : Cstr with int and bool
      : Cstr with initializer_list
      The make functions use the parentheses to perfect forward the arguments. This is because braces cannot be used for perfect forwarding
** Item 23 - Understand =std::move= and =std::forward= 
   =std::move= simply casts the argument to a rvalue reference. The code snippet given below demonstrates this. Here v0 is moved into v1 and hence the move constructor of =std::vector= is called which makes the size of v0 to zero, where with =std::move(v1)= we are not really calling the move constructor we are only casting the lvalue to rvalue reference and hence the size is still not reset to 0.
   #+begin_src C++ :results output 
          #include <iostream>
          #include <vector>

          int main() {
              std::vector<int> v0{1, 2, 3, 4, 5};
              auto v1 = std::move(v0);
              std::move(v1);
              std::cout << "Size after move op: " << v0.size() << "\n";
              std::cout << "Size without move op: " << v1.size() << "\n";
              return 0;
          }
   #+end_src

   #+RESULTS:
   : Size after move op: 0
   : Size without move op: 5

   #+begin_src C++ :results output 
     #include <iostream>

     int foo(const int& val) {
         std::cout<<"const lval ref\n";
     }
     int foo(int&& val) {
         std::cout<<"rval ref\n";
     }

     int main() {
         foo(1);
         int a = 1;
         foo(a);
         foo(std::move(a));
         const int b = 2;
         foo(std::move(b));
         return 0;
     }
   #+end_src

   #+RESULTS:
   : rval ref
   : const lval ref
   : rval ref
   : const lval ref

   what happens when the function overload contains move and const lval ref overlaods?
   pass by value move idiom
